In [1]:
#for mathematical computation
import pandas as pd
import numpy as np
import scipy.stats as stats
import datetime

#for data visualization

import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.pyplot import figure

# for API

import requests
from IPython.display import Image
from pandas.plotting import andrews_curves
%matplotlib inline

#To displa all the columns

pd.set_option('display.max_columns', None)

### Uploading the weather data

In [2]:
Winter_2017 = pd.read_csv('../data/Weather/Winter_2017.csv',skiprows=3) #Dec 2016 - Feb 2017 Statewide Average Temperature
Winter_2018 = pd.read_csv('../data/Weather/Winter_2018.csv',skiprows=3) #Dec 2017 - Feb 2018 Statewide Average Temperature
Winter_2019 = pd.read_csv('../data/Weather/Winter_2019.csv',skiprows=3) #Dec 2018 - Feb 2019 Statewide Average Temperature
#https://www.ncdc.noaa.gov/cag/statewide/mapping

### Winter Weather

In [3]:
Winter_2017.head()

,Location ID,Location,Value,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,52.7,123,6.1,46.6
1,200,Arizona,45.5,119,3.2,42.3
2,300,Arkansas,46.7,125,5.4,41.3
3,400,California,44.3,75,0.7,43.6
4,500,Colorado,28.6,113,3.2,25.4

###                                    Create Pre-COVID weather data

In [4]:
Winter_2017.rename(columns={'Value':'Temp_2017'},inplace=True)

In [5]:
Winter_2017 = Winter_2017[['Location ID','Location','Temp_2017']]
Winter_2017.head (1)

   Location ID Location  Temp_2017
0          100  Alabama       52.7

In [6]:
Winter_2018.rename(columns={'Value':'Temp_2018'},inplace=True)

In [7]:
Winter_2018 = Winter_2018[['Location ID','Location','Temp_2018']]

In [8]:
Winter_17_18 = pd.merge(Winter_2017,Winter_2018,how='inner',on = 'Location ID')

In [9]:
Winter_17_18.head(1)

   Location ID Location_x  Temp_2017 Location_y  Temp_2018
0          100    Alabama       52.7    Alabama       48.4

In [10]:
Winter_2019.rename(columns={'Value':'Temp_2019'},inplace=True)

In [11]:
Winter_2019.head(1)

,Location ID,Location,Temp_2019,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,50.5,116,4.0,46.5

In [12]:
Winter_17_18_19= pd.merge(Winter_17_18,Winter_2019,how='inner', on='Location ID')

In [13]:
Winter_17_18_19.head(2)

,Location ID,Location_x,Temp_2017,Location_y,Temp_2018,Location,Temp_2019,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,52.7,Alabama,48.4,Alabama,50.5,116,4.0,46.5
1,200,Arizona,45.5,Arizona,47.0,Arizona,42.0,43,-0.2,42.2

In [14]:
pre_covid_winter = Winter_17_18_19[['Location','Temp_2017','Temp_2018','Temp_2019']]

In [15]:
pre_covid_winter.head(1)

  Location  Temp_2017  Temp_2018  Temp_2019
0  Alabama       52.7       48.4       50.5

In [93]:
Temp_mean = round(pre_covid_winter.mean(axis=1),1)

In [94]:
pre_covid_winter['Winter_Avg_Temp']= Temp_mean

<ipython-input-94-d91815161d52>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pre_covid_winter['Winter_Avg_Temp']= Temp_mean

In [95]:
pre_covid_winter.head(1)

  Location  Temp_2017  Temp_2018  Temp_2019  Winter_Avg_Temp
0  Alabama       52.7       48.4       50.5             50.5

In [19]:
coldest_states= pre_covid_winter.sort_values('Winter_Avg_Temp', ascending=True)

In [20]:
coldest_states.head(8)

        Location  Temp_2017  Temp_2018  Temp_2019  Winter_Avg_Temp
31  North Dakota       14.0       10.9        9.3        11.400000
20     Minnesota       17.9       10.8       10.7        13.133333
38  South Dakota       20.4       17.1       16.5        18.000000
23       Montana       18.3       18.1       18.3        18.233333
46     Wisconsin       22.4       16.2       17.2        18.600000
16         Maine       20.9       18.0       16.9        18.600000
47       Wyoming       20.4       22.7       20.1        21.066667
42       Vermont       24.8       20.0       19.0        21.266667

In [21]:
hot_states= round(pre_covid_winter.sort_values('Winter_Avg_Temp', ascending=False),1)

In [22]:
hot_states.head(8)

          Location  Temp_2017  Temp_2018  Temp_2019  Winter_Avg_Temp
7          Florida       64.7       62.0       62.6             63.1
15       Louisiana       57.7       51.8       53.4             54.3
8          Georgia       53.9       50.3       51.5             51.9
0          Alabama       52.7       48.4       50.5             50.5
21     Mississippi       53.1       48.0       50.1             50.4
40           Texas       52.9       48.0       49.1             50.0
37  South Carolina       52.0       48.6       49.4             50.0
3       California       44.3       47.7       43.8             45.3

In [97]:
# pre_covid_winter.to_csv('../data/pre_covid_winter.csv', index = False) # Create a csv file of the Pre COVID winter

### Summer Months

In [24]:
Summer_2017 = pd.read_csv('../data/Weather/Summer_2017.csv',skiprows=3) #Jun 2017 - Aug 2017 Statewide Average Temperature
Summer_2018 = pd.read_csv('../data/Weather/Summer_2018.csv',skiprows=3) #Jun 2018 - Aug 2018 Statewide Average Temperature
Summer_2019 = pd.read_csv('../data/Weather/Summer_2019.csv',skiprows=3) #Jun 2019 - Aug 2019 Statewide Average Temperature

In [25]:
Summer_2017.head()

,Location ID,Location,Value,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,78.4,37,-0.5,78.9
1,200,Arizona,80.1,121,2.8,77.3
2,300,Arkansas,77.7,25,-1.1,78.8
3,400,California,76.5,126,4.3,72.2
4,500,Colorado,66.3,108,1.8,64.5

In [26]:
Summer_2017.rename(columns={'Value':'Temp_2017'},inplace=True)

In [27]:
Summer_2017 = Summer_2017[['Location ID','Location','Temp_2017']]
Summer_2017.head (1)

   Location ID Location  Temp_2017
0          100  Alabama       78.4

In [28]:
Summer_2018.rename(columns={'Value':'Temp_2018'},inplace=True)

In [29]:
Summer_2018 = Summer_2018[['Location ID','Location','Temp_2018']]

In [30]:
Summer_17_18 = pd.merge(Summer_2017,Summer_2018,how='inner',on = 'Location ID')

In [31]:
Summer_17_18.head(2)

   Location ID Location_x  Temp_2017 Location_y  Temp_2018
0          100    Alabama       78.4    Alabama       79.8
1          200    Arizona       80.1    Arizona       80.4

In [32]:
Summer_2019.rename(columns={'Value':'Temp_2019'},inplace=True)

In [33]:
Summer_17_18_19= pd.merge(Summer_17_18,Summer_2019,how='inner', on='Location ID')

In [34]:
pre_covid_Summer = Summer_17_18_19[['Location','Temp_2017','Temp_2018','Temp_2019']]

In [35]:
Summer_Temp_mean = pre_covid_Summer.mean(axis=1)

In [36]:
pre_covid_Summer['Summer_Avg_Temp']= round(Summer_Temp_mean,1)

<ipython-input-36-87643371dec1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pre_covid_Summer['Summer_Avg_Temp']= round(Summer_Temp_mean,1)

In [37]:
pre_covid_Summer.head()

     Location  Temp_2017  Temp_2018  Temp_2019  Summer_Avg_Temp
0     Alabama       78.4       79.8       79.8             79.3
1     Arizona       80.1       80.4       79.7             80.1
2    Arkansas       77.7       80.2       78.3             78.7
3  California       76.5       75.8       74.5             75.6
4    Colorado       66.3       67.6       66.0             66.6

### Write to csv

In [38]:
#pre_covid_Summer.to_csv('../data/pre_covid_Summer.csv', index = False) # Create a csv file of the Pre COVID winter

### Birth data

In [39]:
Birth = pd.read_csv('../data/Birth/Birth_by_year.csv')

In [40]:
Birth.head()

,CountryCode,Area,Year,January,February,March,April,May,June,July,August,September,October,November,December,UNK,TOT
0,USA,1,2000,330108,317377,340553,317180,341207.0,341206,348975,360080,347609,343921,333811,336787,.,4058814
1,USA,1,2001,335198,303534,338684,323613,344017.0,331085,351047,361802,342564,344074,323746,326569,.,4025933
2,USA,1,2002,330674,303977,331505,324432,339007.0,327588,357669,359417,348814,345814,318573,334256,.,4021726
3,USA,1,2003,329803,307248,336920,330106,346754.0,337425,364226,360103,359644,354048,320094,343579,.,4089950
4,USA,1,2004,332907,315821,346348,333335,337651.0,344881,359426,355408,356033,348466,335704,346072,.,4112052

### Summer births for 2017,2018,2019

In [41]:
Summer = Birth[['Year','February','March','April','May']]

In [42]:
Summer.head()

   Year  February   March   April       May
0  2000    317377  340553  317180  341207.0
1  2001    303534  338684  323613  344017.0
2  2002    303977  331505  324432  339007.0
3  2003    307248  336920  330106  346754.0
4  2004    315821  346348  333335  337651.0

In [43]:
Summer_birth = Summer.iloc[18:21]
Summer_birth

    Year  February   March   April       May
18  2018    284250  316044  298394  320622.0
19  2019    279963  304237  298947  316386.0
20  2020    282601  301457  290252  301313.0

In [44]:
Summer_birth.dtypes

Year          int64
February      int64
March         int64
April         int64
May         float64
dtype: object

In [45]:
Year= Summer_birth['Year'].astype(str)

In [46]:
Summer_birth['Year']= Year

<ipython-input-46-2ccfbdf2044b>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Summer_birth['Year']= Year

In [47]:
Summer_birth.dtypes

Year         object
February      int64
March         int64
April         int64
May         float64
dtype: object

In [48]:
Summer_birth

    Year  February   March   April       May
18  2018    284250  316044  298394  320622.0
19  2019    279963  304237  298947  316386.0
20  2020    282601  301457  290252  301313.0

In [49]:
total= Summer_birth.sum(axis=1)

In [50]:
Summer_birth['Total']= total
Summer_birth

<ipython-input-50-1a9cd72f9abe>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  Summer_birth['Total']= total

    Year  February   March   April       May      Total
18  2018    284250  316044  298394  320622.0  1219310.0
19  2019    279963  304237  298947  316386.0  1199533.0
20  2020    282601  301457  290252  301313.0  1175623.0

### Write to csv

In [89]:
Summer_birth.to_csv('../data/Summer_birth.csv',index = False) # Create a csv file of the Pre COVID summer births

### Winter Births for 2017,2018,2019

In [51]:
Birth.head()

,CountryCode,Area,Year,January,February,March,April,May,June,July,August,September,October,November,December,UNK,TOT
0,USA,1,2000,330108,317377,340553,317180,341207.0,341206,348975,360080,347609,343921,333811,336787,.,4058814
1,USA,1,2001,335198,303534,338684,323613,344017.0,331085,351047,361802,342564,344074,323746,326569,.,4025933
2,USA,1,2002,330674,303977,331505,324432,339007.0,327588,357669,359417,348814,345814,318573,334256,.,4021726
3,USA,1,2003,329803,307248,336920,330106,346754.0,337425,364226,360103,359644,354048,320094,343579,.,4089950
4,USA,1,2004,332907,315821,346348,333335,337651.0,344881,359426,355408,356033,348466,335704,346072,.,4112052

In [52]:
winter = Birth[['Year','August','September','October','November']]

In [53]:
winter_birth= winter.iloc[17:20]
winter_birth

    Year  August September October November
17  2017  352151    337175  329869   316511
18  2018  344750    322772  326778   308703
19  2019  341685    325781  325043   298086

In [54]:
winter_birth.dtypes

Year          int64
August       object
September    object
October      object
November     object
dtype: object

In [78]:
months = winter_birth[['August','September','October','November']].astype(int)

In [79]:
winter_birth[['August','September','October','November']] = months

C:\Users\Test\lib\site-packages\pandas\core\frame.py:3191: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[k1] = value[k2]

In [81]:
year= winter_birth['Year'].astype(str)

In [82]:
winter_birth['Year']= year

<ipython-input-82-2327839b0d78>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  winter_birth['Year']= year

In [83]:
winter_birth.dtypes

Year         object
August        int32
September     int32
October       int32
November      int32
dtype: object

In [85]:
Win_total = winter_birth.sum(axis=1)

In [86]:
winter_birth['Total']= Win_total

<ipython-input-86-80507f2cbd81>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  winter_birth['Total']= Win_total

In [87]:
winter_birth

    Year  August  September  October  November    Total
17  2017  352151     337175   329869    316511  1335706
18  2018  344750     322772   326778    308703  1303003
19  2019  341685     325781   325043    298086  1290595

### Write to cvs

In [88]:
#winter_birth.to_csv('../data/winter_birth.csv', index = False) # Create a csv file of the Pre COVID winter births

### Gathering birth dataset

In [104]:
#API 

import requests
from IPython.display import Image
from pandas.plotting import andrews_curves

In [107]:
endpoint = 'https://api.census.gov/data/2019/acs/acs1/profile?get=group(DP03)&for=metropolitan%20statistical%20area/micropolitan%20statistical%20area:*'

In [ ]:
# https://api.census.gov/data/2017/pep/population?get=GEONAME,POP&for=state:01&key=YOUR_KEY_GOES_HERE

In [ ]:
# endpoint = 'api.census.gov/data/2017/pep/components?get=BIRTHS,DEATHS,GEONAME&for=state:06&PERIOD=7&key=YOUR_KEY'

In [ ]:
parameters

In [108]:
response = requests.get(endpoint)
response.status_code
if response.status_code == 200:
    print('Success :-)')
else:
    print('Not Found.')

Success :-)

In [109]:
print (response.text) # the response text data

IOPub data rate exceeded.
The notebook server will temporarily stop sending output
to the client in order to avoid crashing it.
To change this limit, set the config variable
`--NotebookApp.iopub_data_rate_limit`.

Current values:
NotebookApp.iopub_data_rate_limit=1000000.0 (bytes/sec)
NotebookApp.rate_limit_window=3.0 (secs)

In [ ]:
#print (response.headers) # all the headers

In [ ]:
json_response = response.json () # to see the json data 
type (json_response) # the type of data format

### Create female childbearing population table

In [55]:
# North_Dakota = pd.read_excel('../data/North_Dakota.xlsx',skiprows=4)
# North_Dakota.head(3)

In [56]:
# North_Dakota_age= North_Dakota[['Age','2017 Female','2018 Female','2019 Female']]
# North_Dakota_age.head()

In [57]:
# North_Dakota_age2= North_Dakota_age.iloc[5:11]

In [58]:
# North_Dakota_age2

## Get the Weather Data from National Centers for Environmental Information (NCEI)

In [59]:
# endpoint = 'https://www.ncei.noaa.gov/access/services/data/v1?dataset=global-summary-of-the-year&dataTypes=DP01,DP05,DP10,DSND,DSNW,DT00,DT32,DX32,DX70,DX90,SNOW,PRCP&stations=ASN00084027&startDate=1952-01-01&endDate=1970-12-31&includeAttributes=true&format=json'

In [60]:
# https://www.ncei.noaa.gov/access/services/data/v1?dataset=global-summary-of-the-year&dataTypes=DP01,DP05,DP10,DSND,DSNW,DT00,DT32,DX32,DX70,DX90,SNOW,PRCP&stations=ASN00084027&startDate=1952-01-01&endDate=1970-12-31&includeAttributes=true&format=json

In [61]:
# endpoint = 'https://data.nashville.gov/resource/fuaa-r5cm.json'  # got the endpoint off the website

In [62]:
# parameters= {"year": "2016","query_text": "fire", '$limit': 50000} #set my parameters in a dictionary (what i'm looking for)

In [63]:
# response= requests.get(endpoint) # requested to get the website API. 
# response.status_code
# if response.status_code == 200:
#     print('Success :-)')
# else:
#     print('Not Found.')

In [64]:
# print (response.text) # the response text data

In [65]:
# print (response.headers) # all the headers

In [66]:
# json_response = response.json () # to see the json data 
# #type (json_response) # the type of data format 
# print(json_response)

In [67]:
# weather = pd.DataFrame (json_response) #changed the json into a data frame

In [68]:
#weather.head()

In [69]:
# weather.describe()

In [70]:
# Monthly Avg. Temperature (ºF)